Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.88/PIC32CM-LS60/include/pic32cm1216ls60064.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if !defined DONT_USE_PREDEFINED_CORE_HANDLERS
/* CORTEX-M23 exception handlers */
void Reset_Handler                 ( void );
void NonMaskableInt_Handler        ( void );
void HardFault_Handler             ( void );
void SVCall_Handler                ( void );
void PendSV_Handler                ( void );
void SysTick_Handler               ( void );
#endif /* DONT_USE_PREDEFINED_CORE_HANDLERS */

#if !defined DONT_USE_PREDEFINED_PERIPHERALS_HANDLERS
/* Peripherals interrupt handlers */
void SYSTEM_Handler                ( void );
void WDT_Handler                   ( void );
void RTC_Handler                   ( void );
void EIC_EXTINT_0_Handler          ( void );
void EIC_EXTINT_1_Handler          ( void );
void EIC_EXTINT_2_Handler          ( void );
void EIC_EXTINT_3_Handler          ( void );
void EIC_EXTINT_4_Handler          ( void );
void EIC_EXTINT_5_Handler          ( void );
void EIC_EXTINT_6_Handler          ( void );
void EIC_EXTINT_7_Handler          ( void );
void EIC_OTHER_Handler             ( void );
void FREQM_Handler                 ( void );
void NVMCTRL_Handler               ( void );
void PORT_Handler                  ( void );
void DMAC_0_Handler                ( void );
void DMAC_1_Handler                ( void );
void DMAC_2_Handler                ( void );
void DMAC_3_Handler                ( void );
void DMAC_OTHER_Handler            ( void );
void USB_Handler                   ( void );
void EVSYS_0_Handler               ( void );
void EVSYS_1_Handler               ( void );
void EVSYS_2_Handler               ( void );
void EVSYS_3_Handler               ( void );
void EVSYS_4_Handler               ( void );
void EVSYS_5_Handler               ( void );
void EVSYS_6_Handler               ( void );
void EVSYS_7_Handler               ( void );
void EVSYS_NSCHK_Handler           ( void );
void PAC_Handler                   ( void );
void SERCOM0_0_Handler             ( void );
void SERCOM0_1_Handler             ( void );
void SERCOM0_2_Handler             ( void );
void SERCOM0_OTHER_Handler         ( void );
void SERCOM1_0_Handler             ( void );
void SERCOM1_1_Handler             ( void );
void SERCOM1_2_Handler             ( void );
void SERCOM1_OTHER_Handler         ( void );
void SERCOM2_0_Handler             ( void );
void SERCOM2_1_Handler             ( void );
void SERCOM2_2_Handler             ( void );
void SERCOM2_OTHER_Handler         ( void );
void SERCOM3_0_Handler             ( void );
void SERCOM3_1_Handler             ( void );
void SERCOM3_2_Handler             ( void );
void SERCOM3_OTHER_Handler         ( void );
void SERCOM4_0_Handler             ( void );
void SERCOM4_1_Handler             ( void );
void SERCOM4_2_Handler             ( void );
void SERCOM4_OTHER_Handler         ( void );
void SERCOM5_0_Handler             ( void );
void SERCOM5_1_Handler             ( void );
void SERCOM5_2_Handler             ( void );
void SERCOM5_OTHER_Handler         ( void );
void TC0_Handler                   ( void );
void TC1_Handler                   ( void );
void TC2_Handler                   ( void );
void TCC0_Handler                  ( void );
void TCC1_Handler                  ( void );
void TCC2_Handler                  ( void );
void TCC3_Handler                  ( void );
void ADC_OTHER_Handler             ( void );
void ADC_RESRDY_Handler            ( void );
void AC_Handler                    ( void );
void DAC_UNDERRUN_Handler          ( void );
void DAC_EMPTY_Handler             ( void );
void PTC_Handler                   ( void );
void TRNG_Handler                  ( void );
void I2S_Handler                   ( void );
void TRAM_Handler                  ( void );
#endif /* DONT_USE_PREDEFINED_PERIPHERALS_HANDLERS */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

/** \brief Configuration of the CORTEX-M23 Processor and Core Peripherals */
#define __FPU_PRESENT                  0 /**< FPU present or not                                                        */
#define __MPU_PRESENT                  1 /**< MPU present or not                                                        */
#define __NVIC_PRIO_BITS               2 /**< Number of NVIC Priority bits                                              */
#define __VTOR_PRESENT                 1 /**< Vector Table Offset Register present or not                               */
#define __Vendor_SysTickConfig         0 /**< Set to 1 if different SysTick Config is used                              */
#define __ARCH_ARM                     1
#define __ARCH_ARM_CORTEX_M            1

/*
 * \brief CMSIS includes
 */
#include "core_cm23.h"
#if defined USE_CMSIS_INIT
#include "system_pic32cmls60.h"
#endif /* USE_CMSIS_INIT */

/** \defgroup PIC32CM1216LS60064_api b'Peripheral Software API'
 *  @{
 */

/* ************************************************************************** */
/**  SOFTWARE PERIPHERAL API DEFINITION FOR PIC32CM1216LS60064                */
/* ************************************************************************** */
#include "component/ac.h"
#include "component/adc.h"
#include "component/ccl.h"
#include "component/dac.h"
#include "component/dmac.h"
#include "component/dsu.h"
#include "component/eic.h"
#include "component/evsys.h"
#include "component/freqm.h"
#include "component/gclk.h"
#include "component/i2s.h"
#include "component/idau.h"
#include "component/mclk.h"
#include "component/nvmctrl.h"
#include "component/opamp.h"
#include "component/osc32kctrl.h"
#include "component/oscctrl.h"
#include "component/pac.h"
#include "component/pm.h"
#include "component/port.h"
#include "component/ptc.h"
#include "component/rstc.h"
#include "component/rtc.h"
#include "component/sercom.h"
#include "component/supc.h"
#include "component/tc.h"
#include "component/tcc.h"
#include "component/tram.h"
#include "component/trng.h"
#include "component/usb.h"
#include "component/wdt.h"
/** @}  b'end of Peripheral Software API' */

/** \addtogroup PIC32CM1216LS60064_id b'Peripheral Ids Definitions'
 *  @{
 */

/* ************************************************************************** */
/*  PERIPHERAL ID DEFINITIONS FOR PIC32CM1216LS60064                          */
/* ************************************************************************** */
#define ID_PAC           (  0) /**< \brief Instance index for PAC (PAC) */
#define ID_PM            (  1) /**< \brief Instance index for PM (PM) */
#define ID_MCLK          (  2) /**< \brief Instance index for MCLK (MCLK) */
#define ID_RSTC          (  3) /**< \brief Instance index for RSTC (RSTC) */
#define ID_OSCCTRL       (  4) /**< \brief Instance index for OSCCTRL (OSCCTRL) */
#define ID_OSC32KCTRL    (  5) /**< \brief Instance index for OSC32KCTRL (OSC32KCTRL) */
#define ID_SUPC          (  6) /**< \brief Instance index for SUPC (SUPC) */
#define ID_GCLK          (  7) /**< \brief Instance index for GCLK (GCLK) */
#define ID_WDT           (  8) /**< \brief Instance index for WDT (WDT) */
#define ID_RTC           (  9) /**< \brief Instance index for RTC (RTC) */
#define ID_EIC           ( 10) /**< \brief Instance index for EIC (EIC) */
#define ID_FREQM         ( 11) /**< \brief Instance index for FREQM (FREQM) */
#define ID_PORT          ( 12) /**< \brief Instance index for PORT (PORT) */
#define ID_AC            ( 13) /**< \brief Instance index for AC (AC) */
#define ID_IDAU          ( 32) /**< \brief Instance index for IDAU (IDAU) */
#define ID_DSU           ( 33) /**< \brief Instance index for DSU (DSU) */
#define ID_NVMCTRL       ( 34) /**< \brief Instance index for NVMCTRL (NVMCTRL) */
#define ID_DMAC          ( 35) /**< \brief Instance index for DMAC (DMAC) */
#define ID_USB           ( 37) /**< \brief Instance index for USB (USB) */
#define ID_EVSYS         ( 64) /**< \brief Instance index for EVSYS (EVSYS) */
#define ID_SERCOM0       ( 65) /**< \brief Instance index for SERCOM0 (SERCOM0) */
#define ID_SERCOM1       ( 66) /**< \brief Instance index for SERCOM1 (SERCOM1) */
#define ID_SERCOM2       ( 67) /**< \brief Instance index for SERCOM2 (SERCOM2) */
#define ID_SERCOM3       ( 68) /**< \brief Instance index for SERCOM3 (SERCOM3) */
#define ID_SERCOM4       ( 69) /**< \brief Instance index for SERCOM4 (SERCOM4) */
#define ID_SERCOM5       ( 70) /**< \brief Instance index for SERCOM5 (SERCOM5) */
#define ID_TC0           ( 71) /**< \brief Instance index for TC0 (TC0) */
#define ID_TC1           ( 72) /**< \brief Instance index for TC1 (TC1) */
#define ID_TC2           ( 73) /**< \brief Instance index for TC2 (TC2) */
#define ID_TCC0          ( 74) /**< \brief Instance index for TCC0 (TCC0) */
#define ID_TCC1          ( 75) /**< \brief Instance index for TCC1 (TCC1) */
#define ID_TCC2          ( 76) /**< \brief Instance index for TCC2 (TCC2) */
#define ID_TCC3          ( 77) /**< \brief Instance index for TCC3 (TCC3) */
#define ID_ADC           ( 78) /**< \brief Instance index for ADC (ADC) */
#define ID_DAC           ( 79) /**< \brief Instance index for DAC (DAC) */
#define ID_PTC           ( 80) /**< \brief Instance index for PTC (PTC) */
#define ID_TRNG          ( 81) /**< \brief Instance index for TRNG (TRNG) */
#define ID_CCL           ( 82) /**< \brief Instance index for CCL (CCL) */
#define ID_I2S           ( 83) /**< \brief Instance index for I2S (I2S) */
#define ID_OPAMP         ( 84) /**< \brief Instance index for OPAMP (OPAMP) */
#define ID_TRAM          ( 85) /**< \brief Instance index for TRAM (TRAM) */

#define ID_PERIPH_MAX    ( 85) /**< \brief Number of peripheral IDs */
/** @}  b'end of Peripheral Ids Definitions' */

